---
kind: property
id: P:Autodesk.Revit.DB.PolymeshTopology.NumberOfFacets
source: html/9852f305-e948-7c24-7b3e-68d37a98be98.htm
---
# Autodesk.Revit.DB.PolymeshTopology.NumberOfFacets Property

The number of facet in the polymesh.

## Syntax (C#)
```csharp
public int NumberOfFacets { get; }
```